const STYLE_ABBREVIATION_MAP = {
    'R': 'ラッシュ',
    'C': 'カウンター',
    'B': 'バースト',
    'RANDOM': 'ランダム'
};

const EXPLORE_SUB_TYPE_MAP = {
    'recovery': 'コンディション回復',
    'tower_power': '塔破力回復',
    'attack_buff': '攻撃力上昇',
    'defense_buff': '防御力上昇',
    'hp_buff': 'HP上昇',
    'status_buff': 'いずれかのステータス上昇'
};

const LEVEL_BONUSES = {
    75: { hp: 210, atk: 25, def: 25, spd: 0 },
    77: { hp: 380, atk: 43, def: 43, spd: 0 },
    79: { hp: 510, atk: 59, def: 59, spd: 0 },
    80: { hp: 600, atk: 70, def: 70, spd: 0 },
};
const RECOMMENDATION_TYPES = ['ラッシュ', 'カウンター', 'バースト', 'ファイター', 'トルーパー', 'スナイパー'];
const EXPLORATION_REWARDS = {
    3500: {
        1: { stat: "1%", condition: "5体", power: "6以下" },
        2: { stat: "3%", condition: "15体", power: "8以下" },
        3: { stat: "5%", condition: "20体＋", power: "13↑" }
    },
    4500: {
        1: { stat: "-", condition: "5体", power: "6以下" },
        2: { stat: "-", condition: "15体", power: "10以下" },
        3: { stat: "-", condition: "20体＋", power: "15以上" }
    },
    5500: {
        1: { stat: "-", condition: "5体1段階", power: "6以下" },
        2: { stat: "-", condition: "10体2段階", power: "11以下" },
        3: { stat: "-", condition: "15体↑2段階＋", power: "16以上" }
    }
};
const connections = {
     'f1-s': ['f1-e1'], 'f1-e1': ['f1-s', 'f1-b1'], 'f1-b1': ['f1-e1', 'f1-b2'], 'f1-b2': ['f1-b1', 'f1-e2', 'f1-o', 'f1-e3'], 'f1-e2': ['f1-b2'], 'f1-o': ['f1-b2'], 'f1-e3': ['f1-b2'],
     'f2-e1': ['f2-s'], 'f2-s': ['f2-e1', 'f2-b1'], 'f2-b1': ['f2-s', 'f2-b2'], 'f2-b2': ['f2-b1', 'f2-o'], 'f2-o': ['f2-b2'],
     'f3-e1': ['f3-s'], 'f3-s': ['f3-e1', 'f3-b1'], 'f3-b1': ['f3-s', 'f3-b2'], 'f3-b2': ['f3-b1', 'f3-o'], 'f3-o': ['f3-b2'],
     'f4-e1': ['f4-s'], 'f4-s': ['f4-e1', 'f4-b1'], 'f4-b1': ['f4-s', 'f4-b2'], 'f4-b2': ['f4-b1', 'f4-o'], 'f4-o': ['f4-b2'],
     'f5-e1': ['f5-s'], 'f5-e2': ['f5-s'], 'f5-s': ['f5-e1', 'f5-e2', 'f5-b1'], 'f5-b1': ['f5-s', 'f5-b2'], 'f5-b2': ['f5-b1', 'f5-o'], 'f5-o': ['f5-b2'],
     'f6-e1': ['f6-b1'],'f6-e2':['f6-b1'],'f6-b1': ['f6-e1','f6-s','f6-e2'], 'f6-s': ['f6-b1', 'f6-b2'], 'f6-b2': ['f6-b3'], 'f6-b3': ['f6-b2', 'f6-o'], 'f6-o': ['f6-b3'],
     'f7-e1': ['f7-b1'], 'f7-b1': ['f7-e1', 'f7-s'], 'f7-s': ['f7-b1', 'f7-b2'], 'f7-b2': ['f7-s', 'f7-b3'], 'f7-b3': ['f7-b2','f7-o'],'f7-o':['f7-b3'],
     'f8-e1': ['f8-s'],'f8-s': ['f8-e1','f8-b1','f8-b2'],'f8-b1': ['f8-s','f8-b3'],'f8-b2': ['f8-s','f8-b3'],'f8-b3': ['f8-b1','f8-b2','f8-o'],'f8-o':['f8-b3'],
     'f9-e1':['f9-b1'],'f9-e2':['f9-b1'],'f9-b1':['f9-e1','f9-e2','f9-s'],'f9-s':['f9-b1','f9-b2'],'f9-b2':['f9-s','f9-b3'],'f9-b3':['f9-b2','f9-o'],'f9-o':['f9-b3'],
     'f10-e1':['f10-b1'],'f10-b1':['f10-e1','f10-s'],'f10-s':['f10-b1','f10-b2'],'f10-b2':['f10-s','f10-b3'],'f10-b3':['f10-b2','f10-e2','f10-e3','f10-o'],'f10-e2':['f10-b3'],'f10-e3':['f10-b3'],'f10-o':['f10-b3'],
     'f11-s':['f11-bl1','f13-br1'],'f11-bl1':['f11-s','f11-bl2','f11-br2'],'f11-br1':['f11-s','f11-br2','f11-bl2'],'f11-bl2':['f11-bl1','f11-el1','f11-br1','f11-bs1'],'f11-el1':['f13-bl2'],'f11-br2':['f11-br1','f11-bl1','f11-er1','f11-bs1'],'f11-er1':['f11-br2'],'f11-bs1':['f11-bl2','f11-br2','f11-o'],'f11-o':['f11-bs1'],
     'f12-s':['f12-bl1','f12-br1'],'f12-bl1':['f12-s','f12-bl2','f12-br2'],'f12-br1':['f12-s','f12-br2','f12-bl2'],'f12-bl2':['f12-bl1','f12-el1','f12-br1','f12-bs1'],'f12-el1':['f12-bl2'],'f12-br2':['f12-br1','f12-bl1','f12-er1','f12-bs1'],'f12-er1':['f12-br2'],'f12-bs1':['f12-bl2','f12-br2','f12-o'],'f12-o':['f12-bs1'],
     'f13-se1':['f13-s'],'f13-s':['f13-bl1','f13-br1'],'f13-bl1':['f13-s','f13-bl2','f13-br2'],'f13-br1':['f13-s','f13-br2','f13-bl2'],'f13-bl2':['f13-bl1','f13-el1','f13-br1','f13-bs1'],'f13-el1':['f13-bl2'],'f13-br2':['f13-br1','f13-bl1','f13-er1','f13-bs1'],'f13-er1':['f13-br2'],'f13-bs1':['f13-bl2','f13-br2','f13-o'],'f13-o':['f13-bs1'],
     'f14-se1':['f14-s'],'f14-s':['f14-bl1','f14-br1'],'f14-bl1':['f14-s','f14-bl2','f14-br2'],'f14-br1':['f14-s','f14-br2','f14-bl2'],'f14-bl2':['f14-bl1','f14-el1','f14-br1','f14-bs1'],'f14-el1':['f14-bl2'],'f14-br2':['f14-br1','f14-bl1','f14-er1','f14-bs1'],'f14-er1':['f14-br2'],'f14-bs1':['f14-bl2','f14-br2','f14-o'],'f14-o':['f14-bs1'],
     'f15-es1':['f15-s'],'f15-s':['f15-bl1','f15-br1'],'f15-bl1':['f15-el1','f15-bs1'],'f15-br1':['f15-er1','f15-bs1'],'f15-bs1':['f15-bs2'],'f15-bs2':['f15-o'],
     'f16-s':['f16-bl1','f16-br1'],'f16-bl1':['f16-bs1','f16-bl2'],'f16-br1':['f16-bs1','f16-br2'],'f16-bs1':['f16-es1','f16-bl2','f16-br2'],'f16-bl2':['f16-bl3','f16-bs2'],'f16-br2':['f16-br3','f16-bs2'],'f16-bs2':['f16-es2'],'f16-bl3':['f16-el1','f16-o'],'f16-br3':['f16-er1','f16-o'],
     'f17-s':['f17-bl1','f17-br1'],'f17-bl1':['f17-bs1','f17-bl2'],'f17-br1':['f17-bs1','f17-br2'],'f17-bs1':['f17-es1','f17-bl2','f17-br2'],'f17-bl2':['f17-bl3','f17-bs2'],'f17-br2':['f17-br3','f17-bs2'],'f17-bl3':['f17-el1','f17-o'],'f17-br3':['f17-er1','f17-o'],
     'f18-es1':['f18-s'],'f18-s':['f18-bl1','f18-br1'],'f18-bl1':['f18-bs1','f18-bl2'],'f18-br1':['f18-bs1','f18-br2'],'f18-bs1':['f18-es2','f18-bl2','f18-br2'],'f18-bl2':['f18-bl3','f18-bs2'],'f18-br2':['f18-br3','f18-bs2'],'f18-bs2':['f18-es3'],'f18-bl3':['f18-el1','f18-o'],'f18-br3':['f18-er1','f18-o'],
     'f19-s':['f19-bl1','f19-br1'],'f19-bl1':['f19-el1','f19-bs1','f19-bl2'],'f19-br1':['f19-er1','f19-bs1','f19-br2'],'f19-bl2':['f19-bs1','f19-bl3','f19-bs2'],'f19-br2':['f19-bs1','f19-br3','f19-bs2'],'f19-bl3':['f19-el2','f19-o'],'f19-br3':['f19-er2','f19-o'],
     'f20-el1':['f20-s'],'f20-er1':['f20-s'],'f20-s':['f20-bl1','f20-br1','f20-bs1'],'f20-bl1':['f20-bl3','f20-bl2'],'f20-bs1':['f20-es1'],'f20-br1':['f20-br2','f20-br3'],'f20-bl2':['f20-bl4','f20-es1','f20-bs2'],'f20-br2':['f20-bs2','f20-br4','f20-es1'],'f20-bl3':['f20-el2','f20-bl4'],'f20-br3':['f20-er2','f20-br4'],'f20-o':['f20-bl4','f20-bs2','f20-br4'],
     'f21-s':['f21-bl1','f21-br1'],'f21-bl1':['f21-bl2','f21-br3'],'f21-br1':['f21-bl3','f21-br2'],'f21-bl2':['f21-bl3'],'f21-br2':['f21-br3'],'f21-bl3':['f21-bl4','f21-br5'],'f21-br3':['f21-bl5','f21-br4'],'f21-bl4':['f21-el1','f21-bl5'],'f21-br4':['f21-br5','f21-er1'],'f21-o':['f21-bl5','f21-br5'],
     'f22-s':['f22-es1','f22-bl1','f22-br1'],'f22-bl1':['f22-bl2','f22-br3'],'f22-br1':['f22-bl3','f22-br2'],'f22-bl2':['f22-bl3'],'f22-br2':['f22-br3'],'f22-bl3':['f22-bl4','f22-br5'],'f22-br3':['f22-bl5','f22-br4'],'f22-bl4':['f22-el1','f22-el2','f22-bl5'],'f22-br4':['f22-br5','f22-er1'],'f22-o':['f22-bl5','f22-br5'],
     'f23-s':['f23-es1','f23-bl1','f23-br1'],'f23-bl1':['f23-bl2','f23-br3'],'f23-br1':['f23-bl3','f23-br2'],'f23-bl2':['f23-bl3','f23-el1'],'f23-br2':['f23-er1','f23-br3'],'f23-bl3':['f23-bl4','f23-br5'],'f23-br3':['f23-bl5','f23-br4'],'f23-bl4':['f23-el2','f23-bl5'],'f23-br4':['f23-br5','f23-er2'],'f23-o':['f23-bl5','f23-br5'],
     'f24-s':['f24-es1','f24-bl1','f24-br1'],'f24-bl1':['f24-bl2','f24-br3'],'f24-br1':['f24-bl3','f24-br2'],'f24-bl2':['f24-bl3'],'f24-br2':['f24-br3'],'f24-bl3':['f24-bl4','f24-br5'],'f24-br3':['f24-bl5','f24-br4'],'f24-bl4':['f24-el1','f24-el2','f24-bl5'],'f24-br4':['f24-br5','f24-er1'],'f24-o':['f24-bl5','f24-br5'],
     'f25-s':['f25-es1','f25-bl1','f25-br1','f25-bs1'],'f25-bl1':['f25-bl2'],'f25-bs1':['f25-bs2'],'f25-br1':['f25-br2'],'f25-bl2':['f25-el1','f25-bl3','f25-bs2'],'f25-br2':['f25-er1','f25-br3','f25-bs2'],'f25-bl3':['f25-el1','f25-bl4'],'f25-bs2':['f25-bl4','f25-br4','f25-o'],'f25-br3':['f25-br4','f25-er1'],'f25-bl4':['f25-el2','f25-o'],'f25-br4':['f25-er2','f25-o'],
     'f26-s':['f26-es1','f26-bl1','f26-bl2','f26-br2','f26-br1'],'f26-bl1':['f26-bl3','f26-bl4'],'f26-bl2':['f26-bl3','f26-bs1'],'f26-br2':['f26-bs1','f26-br3'],'f26-br1':['f26-br4','f26-br3'],'f26-bl4':['f26-el1','f26-bl3'],'f26-br4':['f26-er1','f26-br3'],'f26-o':['f26-bl3','f26-bs1','f26-br3'],
     'f27-s':['f27-es1','f27-bl1','f27-bl2','f27-br2','f27-br1'],'f27-bl1':['f27-bl3','f27-bl4'],'f27-bl2':['f27-bl3','f27-bs1'],'f27-br2':['f27-bs1','f27-br3'],'f27-br1':['f27-br4','f27-br3'],'f27-bl4':['f27-el1','f27-bl3'],'f27-br4':['f27-er1','f27-br3'],'f27-o':['f27-bl3','f27-bs1','f27-br3'],
     'f28-s':['f28-es1','f28-bl1','f28-bl2','f28-br2','f28-br1'],'f28-bl1':['f28-bl3','f28-bl4'],'f28-bl2':['f28-bl3','f28-bs1'],'f28-br2':['f28-bs1','f28-br3'],'f28-br1':['f28-br4','f28-br3'],'f28-bl4':['f28-el1','f28-el2','f28-bl3'],'f28-br4':['f28-er1','f28-br3'],'f28-o':['f28-bl3','f28-bs1','f28-br3'],
     'f29-s':['f29-es1','f29-bl1','f29-bl2','f29-br2','f29-br1'],'f29-bl1':['f29-bl3','f29-bl4'],'f29-bl2':['f29-bl3','f29-bs1'],'f29-br2':['f29-bs1','f29-br3'],'f29-br1':['f29-br4','f29-br3'],'f29-bl4':['f29-el1','f29-bl3'],'f29-br4':['f29-er1','f29-br3'],'f29-o':['f29-bl3','f29-bs1','f29-br3'],
     'f30-s':['f30-bs1'],'f30-bs1':['f30-bs2'],'f30-bs2':['f30-bs3'],'f30-bs3':['f30-bs4'],'f30-bs4':['f30-bs5'],'f30-bs5':['f30-o'],
     'f31-s':['f31-bl1','f31-bl4','f31-br4','f31-br1'],'f31-bl1':['f31-el1','f31-bl2'],'f31-br1':['f31-er1','f31-br2'],'f31-bl2':['f31-bl4','f31-bl3'],'f31-bl3':['f31-bl5','f31-bl6'],'f31-br2':['f31-br4','f31-br3'],'f31-br3':['f31-br5','f31-br6'],'f31-bl4':['f31-bl5'],'f31-bl5':['f31-bs1'],'f31-br4':['f31-br5'],'f31-br5':['f31-bs1'],'f31-bl6':['f31-bl7'],'f31-bs1':['f31-bl7','f31-br7'],'f31-br6':['f31-br7'],'f31-o':['f31-bl7','f31-br7'],
     'f32-s':['f32-bl1','f32-bl4','f32-br4','f32-br1'],'f32-bl1':['f32-el1','f32-bl2'],'f32-br1':['f32-er1','f32-br2'],'f32-bl2':['f32-bl4','f32-bl3'],'f32-bl3':['f32-bl5','f32-bl6'],'f32-br2':['f32-br4','f32-br3'],'f32-br3':['f32-br5','f32-br6'],'f32-bl4':['f32-bl5'],'f32-bl5':['f32-bs1'],'f32-br4':['f32-br5'],'f32-br5':['f32-bs1'],'f32-bl6':['f32-bl7'],'f32-bs1':['f32-bl7','f32-br7'],'f32-br6':['f32-br7'],'f32-o':['f32-bl7','f32-br7'],
     'f33-s':['f33-bl1','f33-bl4','f33-br4','f33-br1'],'f33-bl1':['f33-el1','f33-bl2'],'f33-br1':['f33-er1','f33-br2'],'f33-bl2':['f33-bl4','f33-bl3'],'f33-bl3':['f33-bl5','f33-bl6'],'f33-br2':['f33-br4','f33-br3'],'f33-br3':['f33-br5','f33-br6'],'f33-bl4':['f33-bl5'],'f33-bl5':['f33-bs1'],'f33-br4':['f33-br5'],'f33-br5':['f33-bs1'],'f33-bl6':['f33-bl7'],'f33-bs1':['f33-bl7','f33-br7'],'f33-br6':['f33-br7'],'f33-o':['f33-bl7','f33-br7'],
     'f34-s':['f34-bl1','f34-bl4','f34-br4','f34-br1'],'f34-bl1':['f34-el1','f34-bl2'],'f34-br1':['f34-er1','f34-br2'],'f34-bl2':['f34-bl4','f34-bl3'],'f34-bl3':['f34-bl5','f34-bl6'],'f34-br2':['f34-br4','f34-br3'],'f34-br3':['f34-br5','f34-br6'],'f34-bl4':['f34-bl5'],'f34-bl5':['f34-bs1'],'f34-br4':['f34-br5'],'f34-br5':['f34-bs1'],'f34-bl6':['f34-bl7'],'f34-bs1':['f34-bl7','f34-br7'],'f34-br6':['f34-br7'],'f34-o':['f34-bl7','f34-br7'],
     'f35-s':['f35-bl1','f35-bl2','f35-br2','f35-br1'],'f35-bl1':['f35-bl3'],'f35-bl2':['f35-bl3','f35-bs1'],'f35-br1':['f35-br3'],'f35-br2':['f35-br3','f35-bs1'],'f35-bl3':['f35-el1','f35-bl4'],'f35-bs1':['f35-bs2'],'f35-br3':['f35-er1','f35-br4'],'f35-bl4':['f35-el1','f35-bl5'],'f35-bs2':['f35-bl5','f35-br5'],'f35-br4':['f35-er1','f35-br5'],'f35-o':['f35-bl5','f35-br5']
};

const SIMULATED_CONDITION_SECTIONS = {
    rush: [
        { start: 1, end: 5, limit: 20 },
        { start: 6, end: 21, limit: 20 },
        { start: 22, end: 27, limit: 15 },
        { start: 28, end: 35, limit: 15 },
    ],
    counter: [
        { start: 1, end: 11, limit: 20 },
        { start: 12, end: 21, limit: 20 },
        { start: 22, end: 27, limit: 15 },
        { start: 28, end: 29, limit: 15 },
        { start: 30, end: 35, limit: 15 },
    ],
    burst: [
        { start: 1, end: 16, limit: 20 },
        { start: 17, end: 18, limit: 20 },
        { start: 19, end: 28, limit: 20 },
        { start: 29, end: 35, limit: 15 },
    ]
};