{
    "毒": "ターン終了時に最大HPの20%のダメージを受ける状態です。BOSSの場合は代わりに8%のダメージを受けます。",
    "めまい": "「アタック」「奥義」が使用できず、キャンセルされる状態です。",
    "感電": "「スキル」「覚醒スキル」が使用できず、キャンセルされる状態です。",
    "呪い": "チャージフォトンによる覚醒ゲージ増加および「秘奥義」がキャンセルされる状態です。",
    "暗闇": "「アタック」「スキル」「覚醒スキル」の命中が50%でMISSになる状態です（奥義・オーブ・秘奥義は対象外です）",
    "睡眠": "全ての行動がキャンセルされ、行動不能となる状態です。",
    "凍結": "すべての行動がキャンセルされる状態。攻撃を受けると解除され、その際に受けるダメージが2倍となります。",
    "混乱": "50%の確率で行動がキャンセルされ、残りで味方を誤って「アタック」する可能性あり。自身単体の場合は発動しません。",
    "束縛": "すべての強化効果を受けなくなる状態です",
    "病気": "HP回復効果を受けられなくなる状態です。「ゾンビ」と重複した時は「ゾンビ」のダメージが優先されます。",
    "ノックバック": "対象を後列へ強制移動させる。解除後、ターン終了時に元位置へ戻る。",
    "引き寄せ": "対象を前列へ強制移動させる。解除後、ターン終了時に元位置へ戻る。",
    "煉獄の炎": "付与対象がターン終了時に最大HP*10%ダメージを受ける状態。毎ターン5%ずつ上昇、上限30%。BOSSは4%、毎ターン2%、上限12%。",
    "ねずみ化": "チャージ以外の行動がアタックに変化します。最大HP・攻撃力・防御力・素早さが20%低下。オーブ使用はキャンセル、特殊フォトンは通常通り。",
    "ネズミ化": "チャージ以外の行動がアタックに変化します。最大HP・攻撃力・防御力・素早さが20%低下。オーブ使用はキャンセル、特殊フォトンは通常通り。",
    "ゾンビ": "最大HPが50%上昇、攻撃力+25%。防御力と素早さは0に。回復効果がダメージ化。病気と重複した時は「ゾンビ」のダメージが優先されます。",
    "悪夢": "全ての行動がキャンセルされ、ターン終了時に最大HPの10%ダメージ。BOSSは4%。（睡眠とは別の状態異常としてカウントされます。）",
    "完殺": "この状態異常を受けて戦闘不能になると、蘇生不可。ターン経過によっては解除されません。",
    "即死": "付与された瞬間に戦闘不能になる状態。状態異常治癒では蘇生出来ません。",
    "執心": "効果中、付与者だけを攻撃対象に選ぶ状態。ターゲット指定をしても付与者を優先して狙います。付与者が攻撃対象外なら発動せず。重複した場合は上書きされます。",
    "味方状態異常": "味方に対して状態異常を与える行動です。基本的にはデメリットですが、上手く活用したり、事前に状態異常対策を行うことで、デメリットを軽減させます",
    "攻撃力上昇": "対象の攻撃力が一定割合上昇する状態。",
    "防御力上昇": "対象の防御力が一定割合上昇する状態。",
    "素早さ上昇": "対象の素早さが一定割合上昇する状態。",
    "ダメージ軽減": "通常の攻撃ダメージ（固定ダメージや追加ダメージは対象外）を、一定割合軽減する状態。",
    "自然回復": "ターン終了時に、対象が最大HPの一定割合を回復する状態。",
    "カウンター（反撃付与）": "対象が攻撃を受けたとき、自動で反撃を行う効果。通常の攻撃を受けたときに発動。",
    "状態変化耐性": "対象が“状態異常”または“弱体”を受けなくなる状態（無効化）。",
    "かばう": "味方単体を対象とする攻撃を、対象（かばう効果を持つキャラ）が代わりに受ける状態。",
    "フォトン容量上昇": "対象が保持できるフォトン数（上限）が一定数上昇している状態。",
    "アタック強化": "対象が積んでいるアタックフォトン1段階分、強化された状態（アタック使用時の効果／ダメージが上昇）。",
    "スキル強化": "対象が積んでいるスキルフォトン1段階分、強化された状態（スキル使用時の効果／ダメージが上昇）。",
    "チャージ強化": "対象が積んでいるチャージフォトン1段階分、強化された状態（チャージによる覚醒ゲージ上昇量が増加）。",
    "回数バリア": "対象が複数回攻撃を受けても一定回数はダメージを無効化する状態。",
    "ダメージブロック": "対象が受けるダメージのうち、最大HPの一定割合以下の部分を0にするバリア的な状態。",
    "アタックバリア": "“アタック”または“奥義”から受けるダメージを、一定割合軽減する状態（固定ダメージ・追加ダメージは対象外）。",
    "スキルバリア": "“スキル”または“覚醒スキル”から受けるダメージを、一定割合軽減する状態（固定／追加ダメージは対象外）。",
    "追加ダメージ": "通常攻撃やスキルの与えるダメージに、レベルや固定値分を追加で上乗せする効果。",
    "列化": "本来“単体を対象”のアタック／スキル／覚醒／奥義を、“列（列＝複数・縦列の敵）”に対象拡張する状態。ただし、自身を対象とするものや特定スキルは対象外になる場合あり。",
    "全体化": "本来“単体または列対象”のアクションを“全体”対象に変える状態。ただし自身を含むものは除外する効果あり。",
    "無敵": "受けるダメージを0にする状態（攻撃によるダメージを無効化）。",
    "魅了": "対象が“魅了を付与した味方”の行動を優先して攻撃するようになる状態。魅了発生者の行動に応じて追加効果が発動。",  
    "追撃": "味方がフォトンで“アタック”を行ったとき、対象もすぐに“アタック”を行う状態（フォトン消費なし）。",
    "自動蘇生": "対象が戦闘不能になると、1回だけ自動的に蘇生する状態。蘇生後のHPは効果によって異なる。",
    "状態異常命中": "状態異常を付与するときの命中率を上昇させる効果。ただし、付与“確率（発動率）”には影響を与えない。",
    "回避": "“アタック”“スキル”“覚醒スキル”による攻撃に対して、一定確率でMISS（回避）になる状態。奥義・オーブ・秘奥義などは対象外。",
    "火ダメージ上昇": "対象が“火属性攻撃”を行ったとき、そのダメージが一定割合上昇する状態。",
    "雷ダメージ上昇": "対象が“雷属性攻撃”を行ったとき、そのダメージが一定割合上昇する状態.",
    "覚醒増加量上昇": "覚醒ゲージの増加量が上昇する状態（覚醒ゲージを増加させる効果に追加上昇を加える）。",
    "攻撃力低下": "対象の攻撃力が一定割合低下している状態。",
    "防御力低下": "対象の防御力が一定割合低下している状態。",
    "素早さ低下": "対象の素早さが一定割合低下している状態。",
    "フォトン容量低下": "対象が保持できるフォトン数（上限）が一定数低下している状態（最低値は1）。",
    "アタック劣化": "対象が積んでいるアタックフォトン1段階分、劣化する状態（アタック使用時の効果／ダメージが低下）。",
    "スキル劣化": "対象が積んでいるスキルフォトン1段階分、劣化する状態（スキル使用時の効果／ダメージが低下）。",
    "チャージ劣化": "対象が積んでいるチャージフォトン1段階分、劣化する状態（チャージによる覚醒ゲージ上昇量が低下）。",
    "火耐性低下": "対象が受ける火属性ダメージが一定割合上昇する状態（火耐性が下がる）。",
    "雷耐性低下": "対象が受ける雷属性ダメージが一定割合上昇する state（雷耐性が下がる）。",
    "覚醒増加量低下": "覚醒ゲージの増加量が低下している状態（覚醒効果等で得られるゲージ増加が抑制される）。",
    "炎上": "火属性ダメージを受ける地形。ターン終了時にダメージを受けることがある。",
    "狂炎": "炎上の強化地形。地形ダメージが強化され、火ダメージを受けた回数に応じて地形の攻撃力が上昇・持続ターンが延長。",  
    "滞水": "雷ダメージを受けると、そのダメージが100%上昇する地形。ターン終了時にダメージを受ける可能性あり。",
    "突風": "火ダメージを受けると、そのダメージが100%上昇する地形。ターン終了時の地形ダメージを伴うことあり.",
    "地割れ": "地形上にいると防御力が50%低下し、さらに受ける破断ダメージが増加する。ターン終了時に地形ダメージを受けることもある。",
    "氷結": "地形上にいると攻撃力が25%減少する。ターン終了時の地形ダメージを受けることもある。",
    "凍土": "氷結の強化地形。弱体効果が付与された数に応じて地形ダメージ倍率が上昇。かつ、地形上では攻撃力30%、防御力・素早さ25%低下。加えて、フォトン行動時に様々な弱体効果（攻撃力低下・防御力低下・素早さ低下・フォトン容量低下・耐性低下・アタック／スキル／チャージ劣化・覚醒増加量低下）をランダム付与する。",
    "帯電": "雷ダメージを受ける地形。そこからのダメージを受けると、50%の確率で「感電」状態になる。",
    "浸食": "フォトン行動が終了するたびにダメージを受ける地形（ターン終了時ではない）。ただしオーブ使用は除外される。",
    "強染": "浸食の強化地形。フォトン行動するたびに、受ける地形ダメージが10%ずつ上昇（最大200%）。さらに毎ターン開始時に50%でペインフォトンを1つ追加。",
    "夢幻": "地形上にいると、アタック・スキル・覚醒スキルおよび一部行動が35%の確率でMISSまたはキャンセルになる地形。奥義・オーブ・秘奥義はこの効果対象外。",
    "味方地形": "味方側に付与される地形。味方に有利な効果を与えるタイプの地形（例：加護など）。",
    "列地形": "地形の影響が列（縦列）に及ぶタイプの地形。",
    "全体地形": "地形の影響が全体に及ぶタイプの地形。",
    "地形延長": "既存の地形の持続ターンを延長する効果を与える状態。",
    "海魔の加護": "味方に有利な加護地形。ダメージを20%軽減し、火ダメージを80%軽減。さらに毎ターン終了時にHPを30%回復します。",
    "万雷の加護": "雷攻撃を強化する加護地形。雷ダメージが70%上昇し、攻撃時に与えたダメージの50%分の追加雷ダメージを与える。さらに毎ターン終了時にHPを20%回復します。",
    "勇輝の加護": "強化効果を底上げする加護地形。受ける強化効果の効果量が20%上昇し、強化の残りターン数が減少しなくなります。",
    "影蝕の加護": "攻撃時にHP吸収と固定ダメージを付与する加護地形。HP吸収率15%。攻撃時、付与者の攻撃力35%分の固定ダメージを追加（フォトン数に応じて増加）。固定ダメージの上限は付与者攻撃力の350%。",
    "フォトン破壊": "敵が積んでいるフォトンのうち、最も先に使われる順番のものから順に破壊する効果。フォトンの個数を減らし、敵の行動を妨げる事が可能です。",  
    "フォトン奪取": "敵が積んでいるフォトンを奪い取り、自身または味方に付与する効果。敵の行動回数を減らしつつ、自分側に行動資源を得ることができる。",  
    "覚醒ゲージ減少": "敵の覚醒ゲージを一定量減少させ、覚醒スキルや奥義発動を遅らせる妨害手段。",  
    "強化解除": "敵に付与されているバフ・強化効果（攻撃力上昇、防御力上昇、ダメージ軽減など）を全て解除する効果。バフ優勢の敵に対する対策として有効。",  
    "フォトン転換": "敵のフォトンを強制的にペインフォトン（ペイン効果：使用時に防御力に依存した反動ダメージを受けるフォトン）に変える妨害効果。妨害とデバフを同時に与えることが可能。",  
    "ペインフォトン追加": "敵側（または味方側）に、ペインフォトンを追加で付与する効果。ペインフォトンは使用時に追加の反動ダメージを伴うため、戦況を不利にできる。",
    "バーサーク": "ターン終了時、最大HPの一部を失う代わりに自身の攻撃力がターン経過に応じて上昇し続ける状態。",
    "点穴": "点穴レベルに応じた追加ダメージを「単体を対象にした1回攻撃」に乗せる状態。攻撃後、点穴レベルは0になる。最大レベルは100。",
    "固定砲台": "点穴レベルが上昇しなくなり、全てのフォトン行動が「点穴レベルを10消費する単体1回攻撃」に変化する状態。",
    "点穴結集": "点穴レベルが上昇する際、一定回数だけその上昇量を増加させる状態。",
    "ライブ": "発動者を中心とし、味方全体に継続的な複数の特殊効果を付与する状態。別のライブが発動されたり、発動者が行動不能になると解除される。",
    "ライブ効果": "ライブが発動した瞬間に発生する特殊状態。効果はライブごとに異なる。",
    "ライブ効果アタック": "ライブ発動ターンに発動者がアタックフォトンを得ると発生する特殊状態。",
    "ライブ効果スキル": "ライブ発動ターンに発動者がスキルフォトンを得ると発生する特殊状態。",
    "ライブ効果チャージ": "ライブ発動ターンに発動者がチャージフォトンを得ると発生する特殊状態。",
    "ハイドロボム": "数ターン後に爆発しダメージを与える爆弾を付与する状態。他のボムの爆発に誘爆する。速、重、錬の3種類があります。",
    "ハイドロボム重": "起爆までのターンが長い代わりに、爆発時のダメージが大きいハイドロボムです。主にダメージソースとして利用されます。",
    "Hボム重": "起爆までのターンが長い代わりに、爆発時のダメージが大きいハイドロボムです。主にダメージソースとして利用されます。",
    "ハイドロボム速": "起爆までのターンが短く、ダメージは低いものの、素早く起爆させられるハイドロボムです。主に特性やME（マスエフェクト）の発動トリガーとして利用されます。",
    "Hボム速": "起爆までのターンが短く、ダメージは低いものの、素早く起爆させられるハイドロボムです。主に特性やME（マスエフェクト）の発動トリガーとして利用されます。",
    "ハイドロボム錬": "起爆までのターンがとても長い代わりに、既に付与されているハイドロボムを合成して、さらに大きなダメージを与えることが可能になるハイドロボムです。",
    "エレキ": "雷ダメージを受けるとダメージを軽減する代わりにエレキレベルが上昇し、解除時にレベルに応じた固定ダメージを与える状態。エレキを解除した際に与えられる固定ダメージはエレキレベル＊1400で、最大エレキレベルは50です。",
    "励起": "フォトンを使用したアクションを2回連続で行う状態。オーブは対象外。",
    "封印": "覚醒ゲージが最大の時にアタックフォトンを使用すると、奥義がキャンセルされ通常のアタックになる状態。",
    "回数チェイン": "一定回数、自身の行動に「味方単体にチェイン」効果を追加する状態。",
    "アーマー": "HPとは別の耐久値を付与する状態。ダメージを受けるとHPの代わりにアーマーが減少し、0になると解除される。",
    "エール": "HPが50%以下になった時、蓄積された音符の数に応じて一度だけHPを回復する状態。",
    "回数防御貫通": "一定回数、自身の攻撃が対象の防御力を指定された割合で無視する状態。",
    "遅延行動": "指定したターン数の経過後、行動開始時に特定の行動を行う状態。",
    "巨大化": "自身が巨大化し、最大HP・攻撃力・防御力が上昇し、アタックが全体化するなどのシフト効果を得る状態。",
    "ブレイク待機": "特定のフォトンに対し、ブレイク（行動妨害）を発動できる待機状態。",
    "攻撃力昇華": "チェイン数に応じて攻撃力が上昇する状態。チェインが途切れると効果量も元に戻る。",
    "レイズギフト": "付与されたまま戦闘不能になると、蘇生時に特定の効果を発揮する状態。",
    "デスギフト": "戦闘不能になった時に、特定の効果を発揮する状態。",
    "虚弱": "付与されている弱体・状態異常の種類が多いほど、受けるダメージが上昇する状態。",
    "導": "バレットによる攻撃を受けるとダメージが変動し、受けるたびに導レベルが上昇する状態。",
    "暴奏": "協奏状態の時、音符の発生数が1増加する代わりに、音符が発生しない行動がアタックに変化するなどの効果を持つ状態。",
    "覚醒コスト減少": "奥義や覚醒スキルを発動するために必要な覚醒ゲージの量が一時的に減少する状態。",
    "荷電": "エレキ状態の時、行動するたびに自身のエレキレベルが1上昇する状態。",
    "焼夷砲火": "フォトンを使用すると、積んでいる全フォトンを「焼夷フォトン」に変化させ、その数だけ連続火ダメージ攻撃を行う状態。",
    "オーバーヒート": "フォトンを使用する行動がキャンセルされる状態。オーブは対象外。",
    "剛剣": "一度だけ、フォトンによる攻撃にダメージ上昇、防御貫通、ダメージ軽減無効の効果を付与する状態。",
    "おねだり": "フォトンによる行動が「満足度」を上昇させる行動に変化する状態。要求されたフォトンを使うと満足度が大きく上昇する。",
    "おかえし": "おねだりで溜めた満足度に応じて点穴レベルが上昇し、行動回数が決まるシフト状態。点穴レベルはこの効果以外で上昇しなくなる。",
    "アラプリマ": "一度だけ、使用したフォトンの種類に応じて味方全体の「彩色のオーラ」の色を変化させ、オーラを付与する状態。",
    "回数強化解除無効": "一定回数、自身への強化解除効果を無効化する状態。",
    "回数覚醒増加無効": "一定回数、自身への覚醒ゲージ増加効果を無効化する状態。",
    "クロノ": "自身の防御力が0になる代わりに、高い回避率と攻撃力上昇などを得る状態。敵からダメージを受けると解除される。",
    "従属チェイン": "行動した際、この状態を付与した対象に強制的にチェインする状態。",
    "幻影": "高い回避率とダメージ軽減を得て、攻撃を回避するたびに攻撃力が上昇する状態。",
    "消耗": "攻撃力が大幅に低下し、フォトン容量が減少する状態。",
    "熱唱": "弾撃（音符消費攻撃）で消費する音符の量が1増加する状態。",
    "蓄音": "重奏状態の時、一定回数だけ音符を消費せずに弾撃を行える状態。",
    "解放": "Fインパルスのリリース対象に優先して選ばれ、発動直前に味方全体の強化を解除し、その数に応じて攻撃力が上昇する状態。",
    "捕縛": "バトルに参加できず、行動も対象にもならない状態。フォトンを3回供給されると復帰できる。",
    "ハイドロアンカー": "この状態の対象にHボム速を付与すると、攻防速が低下する状態。",
    "回数SLvリセット無効": "スキルレベルのリセットを一定回数無効化する状態。",
    "舞闘": "重奏状態の時、音符を発生させる攻撃で敵にダメージを与えるたびに攻撃力が上昇する状態。",
    "魂衣": "攻撃を受けるとソウルが増加し、ネクロ状態で特定のステータス上昇効果を得る。攻撃を受けると解除される。",
    "順応": "この状態中に受けた最大ダメージ以下のダメージを0にする状態。再付与されると最大ダメージ記録はリセットされる。",
    "誘雷": "雷ダメージを受けると、自身以外の味方に対して追加の雷ダメージ（誘雷ダメージ）を発生させる状態。発生させると解除される。",
    "回数ブレイク待機解除無効": "ブレイクを発動した際、ブレイク待機の解除を一定回数無効化する状態。",
    "点穴還元": "この状態の対象が点穴攻撃を受けると、攻撃側の消費点穴レベルに応じて敵全体に点穴を付与する状態。",
    "アーマー増強": "アーマーを付与された際、耐久値が上書きされずに合算されるようになる状態。",
    "集疫": "敵味方が行う状態異常付与の対象でなくても、その状態異常を自身にも付与させる状態。",
    "オーバーチャージ": "覚醒ゲージを最大200%まで溜められるようになり、最大まで溜めた超覚醒状態でのみ奥義などが使用可能になる状態。",
    "弱体耐性低下": "対象の弱体に対する耐性を低下させる状態。",
    "饗応": "付与者の攻撃力の一部を対象の攻撃力に加算し、付与者の攻撃力を同量減算する状態。",
    "恐慌": "執心状態の対象に付与でき、執心付与者へのダメージを軽減し、執心が治癒されなくなる状態。",
    "飛翔": "あらゆる行動の対象にならず、ターン終了時に敵単体に火ダメージを与えて解除される状態。",
    "嫉妬": "自身以外の味方が強化されると、自身も同じ強化効果を得る状態。行動終了時に自身はダメージを受ける。",
    "フォトン充填": "フォトンを使用するたびに充填値が増加し、その値に応じて攻撃力とアタックダメージが上昇する状態。",
    "撃墜": "種族特性「飛行」による地形効果無効を無効化する状態。",
    "勇猛のオーラ": "1つにつき攻撃力5%上昇、ダメージ2%軽減。",
    "彩色のオーラ": "「色」によって効果が変化するオーラ。青は攻撃力上昇、黄はダメージ軽減など多様な効果を持つ。",
    "練達のオーラ": "敵に付与されている特殊状態1種類につきダメージが2%上昇する（上限3種）。",
    "伝説のオーラ": "最大HPの2%以下のダメージを無効化し、ターン終了時に確率で覚醒ゲージが+1される。",
    "奮闘のオーラ": "1つにつき防御力8%上昇、確率かばう5%。",
    "堅忍不抜のオーラ": "1つにつき防御力40%上昇、確率かばう25%、自然回復10%。",
    "気炎のオーラ": "1つにつき火ダメージ7%上昇、単体ダメージ3%上昇。",
    "友愛のオーラ": "1つにつき攻撃力3%上昇、自然回復3%。",
    "連撃のオーラ": "1つにつき連続ダメージが2%上昇する。",
    "協奏": "味方の編成に「音符」を蓄積し、その数に応じて味方に様々な強化効果が発動するトランスです。「音符」は協奏状態中に特定のスキルやオーブを使用することで発生し、最大で10個保持され、原則は2ターン経過で消失します。音符が1～4個の間は「攻撃力上昇」と「範囲ダメージ上昇」の効果を得られ、さらに音符が5～10個の間は「大協奏状態」となり、「攻撃力上昇」と「範囲ダメージ上昇」の他に、「アタック強化」と「スキル強化」の効果も得られます。",
    "響撃ダメージ": "蓄積されている音符の数が多いほど威力が増加し、無敵と回数バリアを無視するダメージです。",
    "怒闘":  "味方の編成に「ボルテージ」を蓄積し、バーサーク状態の味方の攻撃性能を強化するトランスです。「ボルテージ」は、バーサーク状態の味方が敵にダメージを与えると、バーサーク状態の味方が数と等しい点数分増加します。蓄積できるボルテージは最大で「70」で、ボルテージ数に応じて、バーサーク状態の味方の「攻撃力上昇」と「バーサークによる自傷ダメージ」が増加します。",
    "バレットアーツ":"味方の編成で、特殊な効果を持つ「バレット」を生成・蓄積し、攻撃時に消費して効果を発揮するトランスです。「バレット」はバレットアーツ状態中に、特定のスキルやオーブなどを使用することで生成され、最大で99個保持され、バレットを消費できるスキルなどによって消費され、バレット毎の固有の効果を発揮します。",
    "ネクロ": "戦闘不能者が出ることで「ソウル」を蓄積し、味方全体の耐久力を上げたり、一度戦闘不能になった味方を大幅に強化するトランスです。「ソウル」はネクロ状態中に敵味方を問わず、戦闘不能者が出るたびに、1体につき原則3増加し、最大で「20」個の保持されます。ネクロ状態中、編成はソウル数に応じて最大30%ダメージを軽減し、さらに、戦闘中１度でも戦闘不能状態になったことのあるキャラクターはソウル数に応じて最大75%、攻撃力、防御力、素早さが上昇します。",
    "Fインパルス": "味方が与えたダメージを「エネルギー」として蓄積し、2ターンに1度、ターン終了時に「リリース」として敵全体に強力な攻撃を行うトランスです。「エネルギー」は味方が敵にダメージを与えた回数に応じて蓄積し、最大で「999」まで保持されます。",
    "リリース": "最も多くエネルギーを蓄積したメギドが、蓄積した全エネルギーを消費して敵全体を攻撃します。エネルギー量に応じて威力と攻撃回数が変化します。ただし、リリース発動者は3ターンの間、特殊状態「消耗」になります",
    "重奏": "味方の編成に「音符」を蓄積し、ダメージ軽減や自然回復効果を得て、敵から攻撃を受けると音符を消費して「弾撃」で反撃するトランスです。「音符」は重奏状態中に特定のスキルやオーブを使用することで発生し、最大で10個保持され、原則は3ターン経過で消失します。音符が1～4個の間は「ダメージ軽減」と「自然回復」の効果を得られ、さらに音符が5～10個の間は「大協奏状態」となり、「ダメージ軽減」と「自然回復」の他に、「アタック強化」と「スキル強化」の効果も得られます。",
   "弾撃": "味方が攻撃を受けた際に音符を消費して発動する、響撃ダメージの攻撃です。",
   "コロッセオ": "１戦闘につき敵/味方それぞれ１回まで使用可能で、敵味方の総ダメージ量を比較し、「優勢」か「劣勢」かによって効果が変化するハイトランスで、一定ターンの経過によって解除されます。コロッセオ中は両編成が「単体ダメージ上昇」と「防御力低下」の効果を受け、さらに「優勢」だと追加で単体ダメージが上昇し、「劣勢」だと追加で防御力が低下する効果を受けます。"
}